/*
    for 문(정말 자주 사용함으로 정말 잘 배워두길 추천)
        ex. 게시글 목록록
    -1. for 문은 초기식/ 조건식/ 증감식으로 구성됨
    -2. i(index) 변수 자주 사용(i -> j -> k ...)
    -3. for 블럭문 내에서 변수값 수정하면 안됌.
    -4. 
*/

#include <stdio.h>

    int main() {

        /* ex. 구구단 2단 출력 for 문
        for (int i=1; i<10; i++); {   
        (초기 i변수 값 지정, 변수 i 범위 지정, i는 1씩 증가<i는 1부터 입력됨됨 -> ++i의 경우 i는 2부터터>)
            printf("2 x %d = %d\n", i, i*2);    
            (초기 변수 i 값 1부터 변수값이 9가 될때까지<변수 값이 10보다 작을때까지> i*2값 출력됨)
        }
        */
}